#include <iostream>
#include <string>
#include <map>
#include <vector>
using namespace std;

map<char, string> inmorse{
    {'a', ".-"}, {'b', "-..."}, {'c', "-.-."}, {'d', "-.."}, {'e', "."},
    {'f', "..-."}, {'g', "--."}, {'h', "...."}, {'i', ".."}, {'j', ".---"},
    {'k', "-.-"}, {'l', ".-.."}, {'m', "--"}, {'n', "-."}, {'o', "---"},
    {'p', ".--."}, {'q', "--.-"}, {'r', ".-."}, {'s', "..."}, {'t', "-"},
    {'u', "..-"}, {'v', "...-"}, {'w', ".--"}, {'x', "-..-"}, {'y', "-.--"},
    {'z', "--.."}, {' ', "."}, {'/', "/"},{ 'а', ".-" }, {'б', "-..."}, {'в', "-.-."}, {'г', "--."}, {'д', "-.."}, {'е', "."},
    {'ф', "..-."}, {'г', "--."}, {'и', "...."}, {'й', ".."}, {'к', ".---"},
    {'л', ".-.."}, {'м', "--"}, {'н', "-."}, {'о', "---"}, {'п', ".--."},
    {'р', ".-."}, {'с', "..."}, {'т', "-"}, {'у', "..-"}, {'ф', "...-"},
    {'х', ".--"}, {'ц', "-..-"}, {'ч', "-.--"}, {'ш', "--.."}, {'щ', "---."},
    {'ъ', "-.-"}, {'ы', "-.--"}, {'э', "..-."}, {'ю', "..-"}, {'я', ".-.-"},
    {'А', ".-"}, {'Б', "-..."}, {'В', "-.-."}, {'Г', "--."}, {'Д', "-.."}, {'Е', "."},
    {'Ф', "..-."}, {'Г', "--."}, {'И', "...."}, {'Й', ".."}, {'К', ".---"},
    {'Л', ".-.."}, {'М', "--"}, {'Н', "-."}, {'О', "---"}, {'П', ".--."},
    {'Р', ".-."}, {'С', "..."}, {'Т', "-"}, {'У', "..-"}, {'Ф', "...-"},
    {'Х', ".--"}, {'Ц', "-..-"}, {'Ч', "-.--"}, {'Ш', "--.."}, {'Щ', "---."},
    {'Ъ', "-.-"}, {'Ы', "-.--"}, {'Э', "..-."}, {'Ю', "..-"}, {'Я', ".-.-"},
    {'0', "-----"}, {'1', ".----"}, {'2', "..---"}, {'3', "...--"},
    {'4', "....-"}, {'5', "....."}, {'6', "-...."}, {'7', "--..."}, {'8', "---.."},
    {'9', "----."}, {' ', "/"}, {'/', "/"}, {'ё', "..-.-"}, {'ё', "..-.-"},
    {'Ё', "..-.-"}, {'ё', "..-.-"}
};

string char_to_morse(char c) {
    if (inmorse.count(tolower(c)) > 0) {
        return inmorse[tolower(c)];
    }
    return "";
}

string str_to_morse(string str) {
    string morse_str = "";
    for (char c : str) {
        morse_str += char_to_morse(c) + " ";
    }
    return morse_str;
}

void trans_to_morse(string input_str) {
    string result = "";
    string current_word = "";
    for (char c : input_str) {
        if (c == ' ') {
            result += str_to_morse(current_word) + " / ";
            current_word = "";
        }
        else {
            current_word += c;
        }
    }
    result += str_to_morse(current_word); // Добавляем последнее слово
    cout << result << endl;
}

int main() {
    setlocale(LC_ALL, "ru");
    string input;
    while (true) {
        cout << "Введите фразу(чтобы завершить программу, введите 'lol':";
        getline(cin, input);
        if (input == "lol") {
            break;
        }
        trans_to_morse(input);
    }
    return 0;
}